% определить предикат mrg(L1, L2, R) который для двух отсортированных списков L1 и L2 
% определяет список R, составленный из этих элементов

mrg([], List, List).

mrg(List, [], List).

mrg([Head1|Tail1], [Head2|Tail2], [Head1|Tail3]) :- 
    Head1 < Head2, mrg(Tail1, [Head2|Tail2], Tail3), !.

mrg([Head1|Tail1], [Head2|Tail2], [Head2|Tail3]) :- 
    mrg([Head1|Tail1], Tail2, Tail3).

% Test:
% ?- mrg([0,4,10,20],[1,2,15,20,80], R).
% R = [0, 1, 2, 4, 10, 15, 20, 20, 80].
%
% ?- mrg([2, 4, 5, 6],[1, 2, 3], R).
% R = [1, 2, 2, 3, 4, 5, 6].
%
% ?- mrg([0, 4, 5, 6],[-1, 0, 1, 2, 15], R).
% R = [-1, 0, 0, 1, 2, 4, 5, 6, 15].
