$ определить предикат mrg(L1, L2, R) который для двух отсортированных списков L1 и L2 
% определяет список R, составленный из этих элементов

mrg([], L2, L2).
mrg(L1, [], L1).

mrg([L1H|L1T], [L2H|L2T], R) :- L1H < L2H, mrg(L1T, [L2H|L2T], RES), append([L1H], RES, R).
mrg([L1H|L1T], [L2H|L2T], R) :- L1H >= L2H, mrg([L1H|L1T], L2T, RES), append([L2H], RES, R).

?- mrg([10,20,30,40],[1,1,15,35,46],L).
L = [1, 1, 10, 15, 20, 30, 35, 40, 46] .

?- mrg([10,20,30,40],[100,110],L).
L = [10, 20, 30, 40, 100, 110] .

?- mrg([10,20,30,40],[],L).
L = [10, 20, 30, 40] .

?- mrg([10,20,30,40],[5,20,25,100],L).
L = [5, 10, 20, 20, 25, 30, 40, 100] .