% определить предикат mrg(L1, L2, R) который для двух отсортированных списков L1 и L2 
% определяет список R, составленный из этих элементов

mrg(L1, L2, R) :- merge(L1, L2, R).
merge([], L2, L2).
merge(L1, [], L1).
merge([H1|T1], [H2|T2], [H1|TR]) :- H1 =< H2, merge(T1, [H2|T2], TR).
merge([H1|T1], [H2|T2], [H2|TR]) :- H1 > H2, merge([H1|T1], T2, TR).

/*
?- mrg([],[],R).
R = [] .

?- mrg([1],[],R).
R = [1] .

?- mrg([],[2],R).
R = [2] .

?- mrg([1],[2],R).
R = [1, 2] .

?- mrg([2],[1],R).
R = [1, 2] .

?- mrg([1,3],[2],R).
R = [1, 2, 3] .

?- mrg([-2,0,6],[-3,-2,0,1,5,6],R).
R = [-3, -2, -2, 0, 0, 1, 5, 6, 6] .
*/