% определить предикат mrg(L1, L2, R) который для двух отсортированных списков L1 и L2 
% определяет список R, составленный из этих элементов

% empty L1
mrg([], S, S).

% empty L2
mrg(S, [], S).

% non-empty L1 and L2
mrg([H1|T1], [H2|T2], [H1|T]) :- H1 < H2, mrg(T1, [H2|T2], T), !.
mrg([H1|T1], [H2|T2], [H2|T]) :- mrg([H1|T1], T2, T).

:-
write("mrg([0,2,4], [1,3,5], S1): "),
mrg([0,2,4], [1,3,5], S1),
writeln(S1),
write("mrg([-4,-2,0, 1, 3], [-5,-3,-1, 1], S2): "),
mrg([-4,-2,0, 1, 3], [-5,-3,-1, 1], S2),
writeln(S2),
write("mrg([1], [0], S3): "),
mrg([1], [0], S3),
writeln(S3),
writeln("").

% mrg([0,2,4], [1,3,5], S1): [0,1,2,3,4,5]
% mrg([-4,-2,0, 1, 3], [-5,-3,-1, 1], S2): [-5,-4,-3,-2,-1,0,1,1,3]
% mrg([1], [0], S3): [0,1]
